In [8]:
import statistics as st
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [ ]:
 Problem Statement: Measures of Central Tendency- I

In [3]:
arr = np.array([1, 2, 3, 4, 5, 6, 2, 3, 4, 5, 5, 5, 5])

In [4]:
print("The Array is:")
print(arr)
print("Mean of the Array is:")
print(st.mean(arr))
print("Median of the Array is:")
print(st.median(arr))
print("Mode of the Array is:")
print(st.mode(arr))

The Array is:
[1 2 3 4 5 6 2 3 4 5 5 5 5]
Mean of the Array is:
3
Median of the Array is:
4
Mode of the Array is:
5

In [ ]:
Problem Statement: Measures of Central Tendency- II

In [6]:
df = pd.DataFrame([[10, 20, 30, 40], [7, 14, 21, 28], [55, 15, 8, 12],
                   [15, 14, 1, 8], [7, 1, 1, 8], [5, 4, 9, 2]],
                  columns=['Apple', 'Orange', 'Banana', 'Pear'],
                  index=['Bag1', 'Bag2', 'Bag3', 'Bag4',
                         'Bag5', 'Bag6'])
display(df)

      Apple  Orange  Banana  Pear
Bag1     10      20      30    40
Bag2      7      14      21    28
Bag3     55      15       8    12
Bag4     15      14       1     8
Bag5      7       1       1     8
Bag6      5       4       9     2

In [7]:
print("Calculating the Mean")
print(df.mean())
 
print("Calculating the Median")
print(df.median())
 
print("Calculating the Mode")
print(df.mode())

Calculating the Mean
Apple     16.500000
Orange    11.333333
Banana    11.666667
Pear      16.333333
dtype: float64
Calculating the Median
Apple      8.5
Orange    14.0
Banana     8.5
Pear      10.0
dtype: float64
Calculating the Mode
   Apple  Orange  Banana  Pear
0      7      14       1     8

In [ ]:
Problem Statement: Measures of Central Tendency- III

In [10]:
df = pd.read_csv("Books.csv")
display(df.head())

,Name,Author,User Rating,Reviews,Price,Year,Genre
0,"Act Like a Lady, Think Like a Man: What Men Re...",Steve Harvey,4.6,5013,17,2009,Non Fiction
1,Arguing with Idiots: How to Stop Small Minds a...,Glenn Beck,4.6,798,5,2009,Non Fiction
2,"Breaking Dawn (The Twilight Saga, Book 4)",Stephenie Meyer,4.6,9769,13,2009,Fiction
3,Crazy Love: Overwhelmed by a Relentless God,Francis Chan,4.7,1542,14,2009,Non Fiction
4,Dead And Gone: A Sookie Stackhouse Novel (Sook...,Charlaine Harris,4.6,1541,4,2009,Fiction

In [11]:
df.isnull().sum()

Name           0
Author         0
User Rating    0
Reviews        0
Price          0
Year           0
Genre          0
dtype: int64

In [22]:
df.rename(columns = {'User Rating':'User_Rating'}, inplace = True)

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 700 entries, 0 to 699
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Name         700 non-null    object
 1   Author       700 non-null    object
 2   User_Rating  700 non-null    float64
 3   Reviews      700 non-null    int64
 4   Price        700 non-null    int64
 5   Year         700 non-null    int64
 6   Genre        700 non-null    object
dtypes: float64(1), int64(3), object(3)
memory usage: 38.4+ KB

In [24]:
df.describe()

       User_Rating        Reviews       Price         Year
count   700.000000     700.000000  700.000000   700.000000
mean      4.639857   19255.195714   12.700000  2015.500000
std       0.218586   23613.443875    9.915162     4.034011
min       3.300000      37.000000    0.000000  2009.000000
25%       4.500000    4987.250000    7.000000  2012.000000
50%       4.700000   10284.000000   11.000000  2015.500000
75%       4.800000   23358.000000   15.000000  2019.000000
max       4.900000  208917.000000  105.000000  2022.000000

In [25]:
rating_df =  df.groupby(['Author'],as_index=False).User_Rating.mean()
rating_df.rename(columns = {'User_Rating':'Average_User_Rating'}, inplace = True)
display(rating_df)

                 Author  Average_User_Rating
0      Abraham Verghese                  4.6
1        Adam Gasiewski                  4.4
2         Adam Mansbach                  4.8
3          Adam Silvera                  4.7
4          Adam Wallace                  4.8
..                  ...                  ...
300    William P. Young                  4.6
301    Wizards RPG Team                  4.8
302  Wonder House Books                  4.6
303  Workman Publishing                  4.8
304        Zhi Gang Sha                  4.6

[305 rows x 2 columns]

In [28]:
price_df =  df.groupby(['Author'],as_index=False).Price.mean()
price_df.rename(columns = {'Price':'Average_Price'}, inplace = True)
display(price_df)

                 Author  Average_Price
0      Abraham Verghese      11.000000
1        Adam Gasiewski       6.000000
2         Adam Mansbach       9.000000
3          Adam Silvera       8.000000
4          Adam Wallace       6.250000
..                  ...            ...
300    William P. Young       8.000000
301    Wizards RPG Team      27.000000
302  Wonder House Books      16.000000
303  Workman Publishing       7.666667
304        Zhi Gang Sha      11.500000

[305 rows x 2 columns]

In [27]:
print("Maximum number of books are written by: ")
display(df['Author'].mode())

Maximum number of books are written by:

0    Gary Chapman
1     Jeff Kinney
Name: Author, dtype: object